const defaultData = ['абака', 'аббат', 'абвер', 'абзац', 'аборт', 'абрек', 'абрис', 'абхаз', 'абцуг', 'абшид', 'аванс', 'авгит', 'авгур', 'авеню', 'авизо', 'авось', 'аврал', 'автол', 'автор', 'агава', 'агама', 'агами', 'агент', 'агнат', 'агнец', 'аграф', 'адепт', 'адрес', 'адряс', 'ажгон', 'азарт', 'азиат', 'айван', 'аймак', 'айран', 'айсор', 'акажу', 'акант', 'акрил', 'аксон', 'актёр', 'актив', 'акула', 'акциз', 'акция', 'аларм', 'алеут', 'алиби', 'алкаш', 'аллея', 'аллюр', 'алмаз', 'алтей', 'алтын', 'алчба', 'алыча', 'альфа', 'амбар', 'амбра', 'амбре', 'амвон', 'амёба', 'аминь', 'ампер', 'ампир', 'ангар', 'ангел', 'анион', 'анкер', 'анонс', 'антик', 'антре', 'анчар', 'аншеф', 'аорта', 'апорт', 'апрош', 'арбуз', 'аргон', 'аргус', 'ареал', 'арека', 'арена', 'арест', 'ариец', 'аркан', 'армия', 'армяк', 'архар', 'архив', 'аршин', 'аскер', 'аскет', 'аспид', 'астат', 'астма', 'астра', 'асцит', 'атака', 'атлас', 'атлет', 'атолл', 'аттик', 'афера', 'афиша', 'ацтек', 'аэроб', 'аэрон', 'бабка', 'бабьё', 'багаж', 'багги', 'багет', 'багор', 'бадан', 'бадья', 'базар', 'базис', 'байга', 'байда', 'байка', 'бакан', 'бакен', 'бакун', 'балда', 'балет', 'балка', 'балок', 'балык', 'банан', 'банда', 'банка', 'барак', 'баран', 'бареж', 'баржа', 'барий', 'барин', 'барит', 'барич', 'барка', 'бармы', 'барон', 'барыш', 'баска', 'басма', 'баснь', 'басня', 'басок', 'басон', 'батат', 'батог', 'батон', 'батут', 'батыр', 'бахта', 'бахча', 'бачок', 'башка', 'башня', 'бегун', 'бедро', 'безик', 'бейка', 'бекар', 'бекас', 'бекон', 'белёк', 'белец', 'белка', 'белок', 'бельё', 'беляк', 'беляш', 'бёрдо', 'берег', 'берет', 'бетон', 'бивак', 'бидон', 'бизон', 'билет', 'билль', 'бином', 'биржа', 'бирка', 'бирюк', 'бирюч', 'бисер', 'битва', 'биток', 'битум', 'битьё', 'битюг', 'благо', 'блажь', 'бланк', 'блато', 'блеск', 'близь', 'блинт', 'блоха', 'блуза', 'блюдо', 'бляха', 'бобёр', 'бобик', 'бобок', 'богач', 'бодяк', 'божба', 'божок', 'бойня', 'бокал', 'болид', 'бомба', 'бонза', 'бонмо', 'бонна', 'бордо', 'борей', 'борец', 'боров', 'борок', 'борть', 'босяк', 'ботва', 'ботик', 'бочаг', 'бочар', 'бочка', 'бочок', 'браво', 'брага', 'брада', 'брань', 'брасс', 'бремя', 'брешь', 'бридж', 'брика', 'бриль', 'бритт', 'бровь', 'бронх', 'броня', 'брошь', 'брыжи', 'брыла', 'брюки', 'брюхо', 'бубен', 'бубна', 'бубон', 'бугай', 'бугор', 'будка', 'будра', 'будяк', 'букан', 'буква', 'букет', 'букле', 'букля', 'букса', 'булат', 'булга', 'булка', 'булла', 'бурав', 'бурак', 'буран', 'бурат', 'бурда', 'бурка', 'бурса', 'бурун', 'бурят', 'бутан', 'бутон', 'бутса', 'бутуз', 'буфер', 'буфет', 'бухта', 'быдло', 'былка', 'былое', 'быльё', 'бытие', 'бытьё', 'бычок', 'бювар', 'бювет', 'бюкса', 'вабик', 'вагон', 'вазон', 'вакса', 'валах', 'валеж', 'валёк', 'валёр', 'валет', 'валец', 'валик', 'валка', 'валок', 'валуй', 'валун', 'валух', 'вальс', 'ванна', 'ванта', 'варан', 'варка', 'варок', 'варяг', 'ватин', 'ватка', 'вафля', 'вахта', 'вдова', 'ведро', 'вёдро', 'ведун', 'вежда', 'векша', 'велюр', 'венгр', 'венец', 'веник', 'венок', 'вепрь', 'верба', 'вервь', 'веред', 'верес', 'верея', 'верки', 'верфь', 'верша', 'весло', 'весна', 'весок', 'весть', 'ветвь', 'ветер', 'ветка', 'ветла', 'вечер', 'вешка', 'вещун', 'взбег', 'взвар', 'взвод', 'вздор', 'вздох', 'взлёт', 'взлом', 'взмах', 'взмёт', 'взмыв', 'взнос', 'взрез', 'взрыв', 'взрыд', 'взыск', 'видео', 'видик', 'видок', 'визаж', 'визир', 'визит', 'вилка', 'вилла', 'вилок', 'винцо', 'виола', 'вираж', 'вирус', 'вирша', 'виски', 'висок', 'вития', 'виток', 'витьё', 'вихор', 'вихрь', 'вишня', 'вклад', 'влага', 'власы', 'внука', 'вобла', 'вогул', 'водка', 'вожак', 'вождь', 'вожжа', 'возик', 'возка', 'возня', 'возок', 'война', 'вокал', 'волан', 'волга', 'волна', 'волок', 'волос', 'волхв', 'вольт', 'вопль', 'ворог', 'ворон', 'ворот', 'ворох', 'ворьё', 'вотум', 'вотяк', 'вошка', 'вояка', 'впуск', 'враки', 'враль', 'врата', 'время', 'вруша', 'вспых', 'всход', 'втора', 'вуаль', 'вчера', 'въезд', 'выбой', 'выбор', 'вывал', 'вывес', 'вывих', 'вывод', 'вывоз', 'выгар', 'выгиб', 'выгон', 'выгул', 'выдел', 'выдох', 'выдра', 'выдув', 'выезд', 'выжиг', 'выжим', 'вызов', 'выкат', 'выкол', 'выкос', 'выкуп', 'выкус', 'вылаз', 'вылет', 'вылов', 'вылом', 'вымах', 'вымор', 'вынос', 'выпад', 'выпал', 'выпар', 'выпас', 'выпор', 'выпот', 'вырез', 'выруб', 'высев', 'вытьё', 'выход', 'вычет', 'вышка', 'вьюга', 'вязка', 'вязок', 'вятич', 'вятка', 'гавот', 'гагат', 'газик', 'газок', 'газон', 'гайка', 'галка', 'галоп', 'галун', 'гамак', 'гамма', 'ганец', 'ганза', 'ганка', 'гараж', 'гарда', 'гарем', 'гарус', 'гаусс', 'гашиш', 'гвалт', 'гейша', 'гелий', 'гемма', 'гений', 'герма', 'герой', 'гетра', 'гетто', 'гжель', 'гибка', 'гидра', 'гиена', 'гиляк', 'гинея', 'гипюр', 'гирло', 'гитан', 'гитов', 'гичка', 'глава', 'главк', 'гладь', 'глина', 'глист', 'глубь', 'глушь', 'глыба', 'глясе', 'гнейс', 'гнида', 'гниль', 'гнома', 'гнусь', 'гобой', 'говор', 'гогот', 'годик', 'годок', 'голец', 'голик', 'голод', 'голос', 'голыш', 'гольд', 'гольё', 'гольф', 'голяк', 'гомон', 'гонец', 'гонка', 'гонор', 'гопак', 'горец', 'горка', 'горло', 'горно', 'город', 'горох', 'горюн', 'гость', 'гофре', 'граве', 'грамм', 'гранд', 'грань', 'графа', 'гребь', 'грёза', 'грена', 'греча', 'грива', 'гридь', 'гриль', 'грипп', 'гроза', 'грозд', 'гросс', 'груда', 'грудь', 'грунт', 'груша', 'грыжа', 'гряда', 'грязь', 'гуано', 'гуашь', 'губан', 'губка', 'гугня', 'гудок', 'гужик', 'гузка', 'гузно', 'гуляш', 'гумма', 'гумми', 'гумно', 'гумус', 'гуран', 'гурда', 'гурия', 'гусак', 'гусар', 'гусёк', 'гусит', 'гусли', 'гуцул', 'гюрза', 'давка', 'дадан', 'дамба', 'дамка', 'дачка', 'дверь', 'дебет', 'дебил', 'дебит', 'дебош', 'дебри', 'дебют', 'девиз', 'девка', 'девон', 'дедка', 'дедок', 'дёжка', 'деизм', 'деист', 'декан', 'декор', 'делёж', 'делец', 'демон', 'демос', 'денди', 'денёк', 'дерби', 'дёрен', 'дерма', 'дерть', 'десна', 'десть', 'детва', 'детка', 'дефис', 'джига', 'джинн', 'дзета', 'дзюдо', 'диана', 'диван', 'диета', 'дикая', 'динар', 'динго', 'дичок', 'длань', 'длина', 'днище', 'добор', 'довод', 'догма', 'дождь', 'дожим', 'дозор', 'дойка', 'дойна', 'дойра', 'докер', 'домёк', 'домен', 'домер', 'домна', 'домра', 'донец', 'донка', 'донна', 'донор', 'донос', 'донце', 'донья', 'дорка', 'досев', 'доска', 'досол', 'досуг', 'досыл', 'досье', 'дофин', 'доход', 'дочка', 'дошка', 'драга', 'драже', 'драка', 'драма', 'дрань', 'древо', 'дрейф', 'дрель', 'дрема', 'дрёма', 'дрена', 'дробь', 'дрова', 'дрога', 'дрожь', 'дрозд', 'дрофа', 'друза', 'друид', 'дрянь', 'дубец', 'дубка', 'дубль', 'дубок', 'дубьё', 'дувал', 'дудак', 'дудка', 'дудук', 'дужка', 'дукат', 'думец', 'думка', 'дунец', 'дунит', 'дунст', 'дупло', 'дурак', 'дурка', 'дурра', 'дурро', 'дутар', 'дутик', 'дутыш', 'дутьё', 'духан', 'душка', 'душок', 'дуэль', 'дщерь', 'дылда', 'дымка', 'дымок', 'дырка', 'дышло', 'дюбек', 'дюкер', 'дюшес', 'дятел', 'евнух', 'еврей', 'егерь', 'егоза', 'ежиха', 'ездка', 'ездок', 'елина', 'емеля', 'ересь', 'ерник', 'ёрник', 'ёршик', 'есаул', 'ехида', 'жажда', 'жакан', 'жакет', 'жакоб', 'жамка', 'жарка', 'жарок', 'жатва', 'жатка', 'жевок', 'желна', 'жёлоб', 'желть', 'желчь', 'жёлчь', 'жених', 'жёнка', 'жеода', 'жердь', 'жерех', 'жерло', 'жесть', 'жетон', 'живец', 'живот', 'живьё', 'жизнь', 'жилет', 'жилец', 'жилка', 'жильё', 'жинка', 'жираф', 'жирок', 'житие', 'житьё', 'жменя', 'жнива', 'жниво', 'жница', 'жокей', 'жрица', 'жулан', 'жулик', 'жульё', 'жупан', 'жупел', 'журка', 'жучка', 'жучок', 'забег', 'забой', 'забор', 'завал', 'завет', 'завод', 'завоз', 'завуч', 'загар', 'загиб', 'загон', 'загул', 'задел', 'задик', 'задок', 'задор', 'заеда', 'заезд', 'зажим', 'зажин', 'зажор', 'зазор', 'зазыв', 'заика', 'зайка', 'заказ', 'закал', 'закат', 'закол', 'закон', 'закуп', 'закут', 'залёт', 'залив', 'зализ', 'залог', 'залом', 'замах', 'замер', 'замес', 'замёт', 'замок', 'замор', 'замша', 'занос', 'запад', 'запал', 'запас', 'запах', 'запев', 'запой', 'запон', 'запор', 'зарез', 'зарод', 'зарок', 'заряд', 'засев', 'засов', 'засол', 'засос', 'засыл', 'затёк', 'затёс', 'затея', 'заток', 'затон', 'затор', 'заумь', 'заход', 'зацеп', 'зачёс', 'зачёт', 'зачин', 'защип', 'звено', 'звень', 'зверь', 'зебра', 'зевок', 'зелье', 'зельц', 'земец', 'земля', 'зенит', 'зенки', 'зерно', 'зернь', 'зефир', 'зипун', 'злато', 'злоба', 'злюка', 'знамя', 'знать', 'зобик', 'золка', 'зомби', 'зраза', 'зубец', 'зубик', 'зубок', 'зулус', 'зурна', 'зыбка', 'зыбун', 'зятёк', 'зятик', 'иваси', 'ивина', 'ивняк', 'иврит', 'игиль', 'игрек', 'игрок', 'игрун', 'идеал', 'идиом', 'идиот', 'иерей', 'ижица', 'избач', 'извет', 'извив', 'извод', 'извоз', 'изгиб', 'изгой', 'излёт', 'излом', 'измол', 'измор', 'износ', 'изъян', 'изыск', 'изюбр', 'икона', 'икота', 'илька', 'ильма', 'имидж', 'инвар', 'ингуш', 'индий', 'индус', 'индюк', 'инжир', 'инока', 'интим', 'инула', 'иония', 'иприт', 'ирбис', 'ирмос', 'искра', 'искус', 'ислам', 'испод', 'испуг', 'иссоп', 'истец', 'истод', 'исток', 'исход', 'иудей', 'ишиас', 'кабак', 'кабан', 'кабил', 'кабул', 'кавун', 'кагал', 'каган', 'кагат', 'кагор', 'кадет', 'кадий', 'кадка', 'кадык', 'казак', 'казан', 'казах', 'казна', 'казнь', 'казус', 'кайен', 'кайла', 'кайло', 'кайма', 'кайра', 'какао', 'калан', 'калач', 'калий', 'калиф', 'калла', 'калым', 'камас', 'камея', 'камин', 'камка', 'камса', 'камус', 'камча', 'камыш', 'канал', 'канат', 'канва', 'канон', 'каноэ', 'канун', 'канюк', 'капер', 'капля', 'капок', 'капор', 'капот', 'каппа', 'карат', 'карга', 'карда', 'карел', 'кариб', 'карст', 'карта', 'каска', 'касса', 'каста', 'катар', 'катер', 'катет', 'катод', 'каток', 'катыш', 'кацап', 'качка', 'кашка', 'кашне', 'кашпо', 'кащей', 'каюта', 'квант', 'кварк', 'кварц', 'квота', 'кегль', 'кегля', 'кекур', 'кельт', 'келья', 'кенар', 'кенаф', 'кепка', 'кефир', 'кивер', 'кивок', 'кизил', 'кизяк', 'кинза', 'киник', 'киоск', 'кипер', 'кирза', 'кирка', 'кирха', 'кисет', 'кисея', 'киска', 'киста', 'кисть', 'кифоз', 'кичка', 'кишка', 'кладь', 'клака', 'класс', 'клёкт', 'клерк', 'клёст', 'клеть', 'клика', 'клико', 'клипс', 'клише', 'клоун', 'клуня', 'клупп', 'клуша', 'клюка', 'кляча', 'кнель', 'кнехт', 'книга', 'кникс', 'кница', 'князь', 'коала', 'кобза', 'кобра', 'кобыз', 'ковач', 'ковёр', 'ковка', 'кожан', 'кожух', 'кожьё', 'козёл', 'кознь', 'козон', 'койка', 'койне', 'койот', 'кокет', 'кокон', 'кокор', 'кокос', 'колба', 'колер', 'колет', 'колея', 'колик', 'колит', 'колка', 'колли', 'колоб', 'колок', 'колон', 'колос', 'колун', 'колча', 'колье', 'кольт', 'комар', 'комик', 'комми', 'комод', 'комок', 'конёк', 'конец', 'коник', 'конка', 'конус', 'конюх', 'копал', 'копач', 'копёр', 'копир', 'копия', 'копка', 'копна', 'копра', 'копун', 'копыл', 'копьё', 'корда', 'кореш', 'корка', 'короб', 'корча', 'корчь', 'корьё', 'коряк', 'косач', 'косая', 'косец', 'космы', 'косок', 'кость', 'косьё', 'косяк', 'котёл', 'котик', 'коток', 'кофей', 'кофий', 'кофта', 'кочан', 'кочет', 'кочка', 'кошка', 'кошма', 'кощей', 'крага', 'кража', 'краля', 'крапп', 'краса', 'кредо', 'креол', 'крепь', 'кресс', 'крест', 'криль', 'крица', 'кроат', 'кровь', 'кроки', 'кроль', 'крона', 'кросс', 'кроха', 'кроше', 'круиз', 'крупа', 'круть', 'круча', 'кручь', 'крыло', 'крыса', 'крыша', 'кубик', 'кубло', 'кубок', 'кудлы', 'кудри', 'кузен', 'кузня', 'кузов', 'кукан', 'кукиш', 'кукла', 'кукша', 'кулак', 'кулан', 'кулёк', 'кулеш', 'кулик', 'кулич', 'кулон', 'культ', 'кумач', 'кумжа', 'кумир', 'кумык', 'кумыс', 'кунак', 'купаж', 'купец', 'купля', 'купол', 'купон', 'кураж', 'курай', 'курец', 'курия', 'курка', 'курок', 'курья', 'кусок', 'кутас', 'кутёж', 'куток', 'кутум', 'кутья', 'кухва', 'кухня', 'кухта', 'кучер', 'кучка', 'кушак', 'кхмер', 'кювет', 'кюрий', 'кюрин', 'лабаз', 'лабет', 'лаваш', 'лавка', 'лавра', 'лагун', 'ладан', 'ладья', 'лазер', 'лазея', 'лазка', 'лазок', 'лайба', 'лайда', 'лайка', 'лакей', 'лампа', 'ламут', 'ландо', 'ланды', 'ланка', 'лапка', 'лапта', 'лапша', 'ларго', 'ларёк', 'ларец', 'ласка', 'лассо', 'латка', 'латук', 'латыш', 'лафет', 'лафит', 'лачка', 'лбина', 'лбище', 'левак', 'левит', 'левша', 'легат', 'легаш', 'ледок', 'лежак', 'лёжка', 'лейка', 'лемеш', 'лемма', 'лемур', 'ленок', 'лента', 'ленто', 'ленца', 'лепет', 'лепка', 'лепра', 'лепта', 'лерка', 'леска', 'лесок', 'лесть', 'лётка', 'леток', 'летун', 'лешак', 'леший', 'лещик', 'лиана', 'ливан', 'ливер', 'лидер', 'лизин', 'лизис', 'лизол', 'лизун', 'ликёр', 'лилея', 'лилия', 'лиман', 'лимит', 'лимон', 'лимфа', 'линёк', 'линза', 'линия', 'липец', 'липка', 'липси', 'лирик', 'лиска', 'литва', 'литер', 'литий', 'лития', 'литка', 'литьё', 'лихач', 'лихва', 'лицей', 'лишай', 'лишек', 'лобан', 'лобби', 'лобик', 'лобок', 'ловец', 'ловля', 'логик', 'лодка', 'ложка', 'ложок', 'локон', 'ломик', 'ломка', 'лонжа', 'лопух', 'лоток', 'лотос', 'лохмы', 'лоция', 'лошак', 'лубок', 'лужок', 'лузга', 'лунит', 'лунка', 'лупка', 'лучик', 'лучок', 'лыжня', 'лысун', 'лытка', 'лычко', 'льяло', 'любка', 'люнет', 'люпин', 'люпус', 'люрик', 'лютик', 'лютня', 'люффа', 'лючок', 'лягва', 'ляжка', 'лямка', 'ляпис', 'лярва', 'ляссе', 'ляшка', 'магик', 'магия', 'магма', 'мадам', 'маета', 'мажор', 'мазар', 'мазер', 'мазик', 'мазка', 'мазло', 'мазня', 'мазок', 'мазур', 'мазут', 'майер', 'майка', 'майна', 'майор', 'макао', 'макет', 'макса', 'макси', 'малёк', 'малец', 'малик', 'малка', 'малый', 'малыш', 'мальё', 'маляр', 'маман', 'мамба', 'мамбо', 'мамка', 'манго', 'манеж', 'манер', 'мание', 'мания', 'манка', 'манко', 'манна', 'манок', 'манси', 'манто', 'манул', 'маори', 'марал', 'маран', 'марго', 'марка', 'марля', 'маска', 'масло', 'масон', 'масса', 'масть', 'матка', 'матюг', 'матюк', 'мафия', 'махан', 'махра', 'мачта', 'медик', 'медок', 'медяк', 'мезга', 'мезон', 'мекка', 'мелок', 'мелос', 'менка', 'мерин', 'мерка', 'месса', 'место', 'месть', 'месье', 'месяц', 'метан', 'метил', 'метис', 'метка', 'мётка', 'метла', 'метод', 'метол', 'метро', 'меццо', 'мечта', 'мешок', 'мигач', 'мидия', 'мизер', 'микст', 'милка', 'милок', 'мильт', 'мимик', 'минёр', 'минор', 'минус', 'миома', 'мираб', 'мираж', 'мирза', 'мирок', 'мирон', 'мирра', 'мирта', 'миска', 'митоз', 'митра', 'мишка', 'мишук', 'млеко', 'могар', 'могол', 'модий', 'модус', 'мойва', 'мойка', 'мойра', 'мокко', 'мокой', 'мокша', 'молва', 'молвь', 'молка', 'молот', 'молох', 'молян', 'моляр', 'монах', 'мопед', 'морда', 'мороз', 'морок', 'морцо', 'моряк', 'мосол', 'мосье', 'мотет', 'мотив', 'мотка', 'мотня', 'моток', 'мотор', 'мотто', 'мохер', 'мохна', 'мохны', 'мочка', 'мошка', 'мошна', 'мразь', 'муаре', 'мужик', 'музга', 'музей', 'мулат', 'мулла', 'муляж', 'мумиё', 'мумия', 'мураш', 'мурза', 'мурин', 'мурло', 'мурья', 'мусор', 'мутон', 'муфта', 'муфти', 'муцин', 'мучка', 'мушар', 'мушка', 'мымра', 'мысик', 'мысль', 'мысок', 'мытьё', 'мычка', 'мышей', 'мышка', 'мышца', 'мэрия', 'мюзет', 'мюрид', 'мякиш', 'мялка', 'мямля', 'мянда', 'мясцо', 'мятеж', 'мятьё', 'набат', 'набег', 'набоб', 'набор', 'навал', 'навар', 'навес', 'навет', 'навис', 'навоз', 'навой', 'навык', 'наган', 'нагар', 'нагиб', 'нагон', 'нагул', 'надел', 'надир', 'надой', 'надув', 'наезд', 'нажиг', 'нажим', 'нажин', 'назём', 'наказ', 'накал', 'накат', 'накол', 'накра', 'налеп', 'налёт', 'налив', 'налим', 'налог', 'налой', 'намаз', 'намёк', 'намёт', 'намин', 'намол', 'намыв', 'нанду', 'нанка', 'нанос', 'напев', 'напой', 'напор', 'нарез', 'народ', 'нарта', 'нарыв', 'наряд', 'насад', 'насос', 'насып', 'натёк', 'натёс', 'натяг', 'наука', 'нафта', 'нахал', 'наход', 'нация', 'начёс', 'начёт', 'начин', 'наяда', 'невер', 'невод', 'негус', 'недра', 'недуг', 'немая', 'немец', 'немка', 'ненец', 'ненка', 'нерка', 'нерпа', 'нетяг', 'нефть', 'нечет', 'нивка', 'низка', 'низок', 'никто', 'нилот', 'нимфа', 'нитка', 'ничто', 'ничья', 'нищая', 'новик', 'новое', 'ножик', 'ножка', 'ножны', 'нойон', 'нолик', 'номад', 'номер', 'нонет', 'нория', 'норка', 'норма', 'норов', 'носач', 'носик', 'носка', 'носок', 'нотис', 'нотка', 'ночка', 'нудга', 'нужда', 'нукер', 'нулик', 'нутро', 'нырец', 'нырок', 'нытик', 'нытьё', 'нюанс', 'оазис', 'обвал', 'обвес', 'обвод', 'обвоз', 'обгон', 'обдел', 'обдир', 'обдув', 'обжиг', 'обжим', 'обжин', 'обжог', 'обзор', 'обида', 'обкат', 'обком', 'обкос', 'облёт', 'облик', 'облов', 'облог', 'облом', 'обман', 'обмен', 'обмер', 'обмёт', 'обмин', 'обмол', 'обмыв', 'обнос', 'ободь', 'образ', 'обрат', 'обрез', 'оброк', 'обруб', 'обруч', 'обрыв', 'обряд', 'обсев', 'обувь', 'обуза', 'обход', 'обчёт', 'общее', 'объём', 'обыск', 'овраг', 'овсец', 'овсюг', 'овчар', 'огонь', 'огрех', 'одёжа', 'одурь', 'ожина', 'озеро', 'озимь', 'озноб', 'ойрот', 'океан', 'окись', 'окиян', 'оклад', 'оклик', 'окоём', 'окрас', 'окрик', 'окрол', 'округ', 'октет', 'окунь', 'олеин', 'олень', 'олеум', 'олива', 'олимп', 'олифа', 'олово', 'ольха', 'омега', 'омела', 'омлет', 'омуль', 'онагр', 'оникс', 'онуча', 'опала', 'опара', 'опека', 'опера', 'опись', 'опиум', 'оплот', 'оплыв', 'опоек', 'опока', 'опора', 'опрос', 'оптик', 'орава', 'орала', 'орало', 'орарь', 'орган', 'оргия', 'орден', 'ордер', 'ореол', 'оржад', 'оркан', 'орлан', 'орлец', 'орлик', 'орляк', 'оршад', 'осада', 'осень', 'осётр', 'осина', 'оскал', 'ослик', 'осляк', 'осман', 'осмий', 'осмол', 'осмос', 'особа', 'особь', 'осоед', 'осока', 'остит', 'остов', 'остюк', 'остяк', 'осыпь', 'отава', 'отара', 'отбив', 'отбой', 'отбор', 'отвал', 'отвар', 'отвес', 'ответ', 'отвод', 'отвоз', 'отгиб', 'отгон', 'отгул', 'отдел', 'отдух', 'отдых', 'отель', 'отжиг', 'отжим', 'отзол', 'отзыв', 'отказ', 'откат', 'откол', 'откос', 'откуп', 'откус', 'отлёт', 'отлив', 'отлов', 'отлог', 'отлуп', 'отмах', 'отмол', 'относ', 'отпад', 'отпал', 'отпор', 'отрез', 'отрог', 'отрок', 'отруб', 'отрыв', 'отряд', 'отсев', 'отсек', 'отсос', 'отток', 'отход', 'отцеп', 'отчал', 'отчёт', 'отчим', 'отъём', 'офеня', 'офорт', 'офсет', 'охват', 'охота', 'очерк', 'ошеек', 'ошкуй', 'ощупь', 'падеж', 'падёж', 'падог', 'падуб', 'падун', 'пайва', 'пайза', 'пайка', 'пакет', 'пакля', 'палас', 'палач', 'палаш', 'палех', 'палец', 'палея', 'палия', 'палка', 'палуб', 'пампа', 'панаш', 'панёр', 'панна', 'панно', 'панты', 'панье', 'панья', 'папах', 'папеж', 'папка', 'парад', 'параф', 'парез', 'парик', 'пария', 'парка', 'парня', 'парок', 'паром', 'парта', 'парун', 'парус', 'парча', 'парша', 'пасма', 'пасмо', 'паста', 'пасть', 'пасха', 'пасюк', 'патан', 'патер', 'патио', 'патлы', 'патуа', 'пауза', 'пафос', 'пахви', 'пахвы', 'пахит', 'пахта', 'пацан', 'пачка', 'пашня', 'паяло', 'певец', 'певун', 'пегаш', 'пекан', 'пекло', 'пемза', 'пенал', 'пенёк', 'пение', 'пенис', 'пенка', 'пенни', 'пенье', 'пеньё', 'пепел', 'пепси', 'перга', 'перёд', 'перец', 'пёрка', 'перло', 'перси', 'перст', 'перье', 'песец', 'пёсик', 'песнь', 'песня', 'песок', 'петит', 'петля', 'петух', 'печка', 'пешец', 'пешка', 'пешня', 'пещер', 'пещур', 'пиала', 'пиано', 'пивко', 'пигус', 'пижма', 'пижон', 'пиита', 'пикан', 'пикап', 'пикёр', 'пикет', 'пикон', 'пикша', 'пилав', 'пилат', 'пилка', 'пилон', 'пилот', 'пиния', 'пинна', 'пинок', 'пинта', 'пипка', 'пират', 'пирит', 'пирке', 'пирог', 'пирок', 'пироп', 'писец', 'питок', 'питон', 'питьё', 'пифос', 'пихта', 'пицца', 'пищик', 'плавь', 'пламя', 'пласт', 'плата', 'плато', 'плаун', 'плаха', 'плебс', 'плева', 'плеер', 'племя', 'плена', 'плеск', 'плёсо', 'плеть', 'плечо', 'плешь', 'плита', 'плица', 'плоть', 'плохо', 'плюха', 'пнище', 'побег', 'побои', 'повал', 'повар', 'повет', 'повод', 'повой', 'погиб', 'погон', 'подий', 'подог', 'подой', 'подол', 'поедь', 'поезд', 'пожар', 'пожня', 'пожог', 'позём', 'позёр', 'позор', 'позыв', 'позык', 'пойка', 'пойло', 'пойма', 'поиск', 'показ', 'покат', 'покер', 'покой', 'покос', 'покус', 'полба', 'полёт', 'полив', 'полип', 'полис', 'полка', 'полог', 'полоз', 'полой', 'полок', 'полом', 'полон', 'полюс', 'поляк', 'поляш', 'помёт', 'помин', 'помои', 'помол', 'помор', 'помпа', 'понос', 'пончо', 'понюх', 'попас', 'попик', 'попка', 'попса', 'порез', 'порей', 'порка', 'порог', 'порок', 'порох', 'порто', 'поруб', 'порча', 'порыв', 'посад', 'посев', 'посол', 'посох', 'посул', 'посыл', 'поташ', 'потёк', 'потир', 'поток', 'потоп', 'потяг', 'поход', 'почва', 'почёт', 'почин', 'почка', 'почта', 'пошиб', 'пошив', 'поэма', 'право', 'праща', 'прель', 'пресс', 'приём', 'прима', 'принц', 'приор', 'причт', 'приют', 'проба', 'проём', 'проза', 'пропс', 'просо', 'проух', 'профи', 'прусс', 'прыск', 'прыть', 'прядь', 'пряжа', 'пряха', 'псарь', 'псина', 'псица', 'псише', 'птаха', 'птица', 'пуант', 'пугач', 'пудик', 'пудра', 'пузан', 'пукля', 'пульс', 'пульт', 'пунец', 'пункт', 'пупок', 'пурга', 'пурин', 'пурка', 'пусто', 'путец', 'путик', 'пуфик', 'пучка', 'пучок', 'пушка', 'пушок', 'пчела', 'пшено', 'пыжик', 'пырей', 'пытка', 'пышка', 'пьеза', 'пьеса', 'пялка', 'пясть', 'пятак', 'пятка', 'пятно', 'пяток', 'радар', 'раджа', 'радий', 'радио', 'радон', 'разик', 'разок', 'разор', 'разум', 'раина', 'район', 'ракия', 'ракша', 'рамка', 'рампа', 'ранет', 'ранец', 'ранка', 'растр', 'ратай', 'ратин', 'раунд', 'рафия', 'рахит', 'рацея', 'рация', 'рачок', 'рвань', 'рвота', 'рдест', 'ребаб', 'ребро', 'ребус', 'ревун', 'регби', 'редан', 'редис', 'редут', 'режим', 'резак', 'резец', 'резка', 'резня', 'резон', 'рейка', 'рельс', 'ремез', 'ремиз', 'ренет', 'рений', 'рента', 'репей', 'репер', 'репка', 'репьё', 'речка', 'решка', 'ржавь', 'ржица', 'ржище', 'ризки', 'рикша', 'ринит', 'рипус', 'риска', 'ритор', 'рифма', 'ришта', 'робот', 'ровик', 'ровня', 'рогач', 'рогоз', 'родий', 'родич', 'родня', 'рожак', 'рожок', 'рожон', 'розан', 'розга', 'рознь', 'ройба', 'ройка', 'рокер', 'рокот', 'ролик', 'роман', 'ромец', 'ромок', 'ромша', 'рондо', 'ронжа', 'ропак', 'ропот', 'ростр', 'ротик', 'роток', 'ротор', 'рохля', 'рояль', 'ртище', 'ртуть', 'рубеж', 'рубец', 'рубин', 'рубка', 'рубль', 'ругня', 'рудяк', 'ружьё', 'руина', 'рукав', 'рулет', 'рулон', 'румба', 'румын', 'рупия', 'рупор', 'русак', 'русин', 'русло', 'рутил', 'ручей', 'ручка', 'рыбак', 'рыбец', 'рыбка', 'рывок', 'рыжак', 'рыжик', 'рында', 'рынок', 'рысак', 'рысца', 'рытьё', 'рычаг', 'рэкет', 'рюмка', 'рюшка', 'рябец', 'рябик', 'рябок', 'рядно', 'рядок', 'ряска', 'рясна', 'саами', 'сабан', 'сабеи', 'сабей', 'сабза', 'сабля', 'сабур', 'саван', 'сагиб', 'садик', 'садно', 'садок', 'сазан', 'сайга', 'сайда', 'сайка', 'сайра', 'саква', 'сакля', 'салат', 'салма', 'салол', 'салон', 'салоп', 'салют', 'саман', 'самба', 'самбо', 'самец', 'самка', 'самум', 'санки', 'сапёр', 'сапка', 'сапог', 'сапун', 'сарай', 'саржа', 'сарыч', 'сатин', 'сатир', 'сауна', 'сахар', 'сачок', 'сбора', 'сброд', 'сброс', 'сбруя', 'свара', 'сваха', 'свеча', 'свиль', 'свист', 'свита', 'свора', 'свояк', 'связа', 'связь', 'сглаз', 'сдача', 'сдвиг', 'сдоба', 'сеанс', 'севба', 'север', 'севок', 'седло', 'седок', 'сеево', 'сезам', 'сезон', 'сейид', 'сейша', 'секач', 'секта', 'селен', 'селин', 'сёмга', 'семит', 'семья', 'сенат', 'сенцо', 'сенцы', 'сепия', 'серия', 'серка', 'серко', 'серна', 'серсо', 'серум', 'сетка', 'сеунч', 'сечка', 'сиаль', 'сивая', 'сивер', 'сивка', 'сивко', 'сивуч', 'сигма', 'сидор', 'сиена', 'сижок', 'сизяк', 'силач', 'силка', 'силок', 'силон', 'силос', 'силур', 'сильф', 'симка', 'синап', 'синец', 'синод', 'синус', 'синяк', 'синяя', 'сипай', 'сирен', 'сирин', 'сироп', 'систр', 'ситар', 'ситец', 'ситро', 'ситце', 'сифон', 'скала', 'скало', 'скань', 'скарб', 'скарн', 'скаут', 'скачь', 'сквер', 'скейт', 'скена', 'скепт', 'скетч', 'скирд', 'склад', 'склеп', 'склиз', 'склон', 'скоба', 'скопа', 'скора', 'скорм', 'скотч', 'скрап', 'скреп', 'скрип', 'скуди', 'скудо', 'скука', 'скула', 'скунс', 'слава', 'слайд', 'слань', 'слега', 'слеза', 'сленг', 'слива', 'слизь', 'слово', 'слуга', 'слуда', 'слука', 'слюда', 'слюна', 'смазь', 'смена', 'смерд', 'смерч', 'смесь', 'смета', 'смола', 'смоль', 'смотр', 'смрад', 'смута', 'смуть', 'смысл', 'снедь', 'сноха', 'сныть', 'собор', 'совет', 'совик', 'совка', 'совок', 'согды', 'согра', 'содом', 'созыв', 'сойка', 'сойма', 'сойот', 'сокол', 'солея', 'солка', 'солод', 'соляр', 'сомик', 'сомье', 'сонет', 'сопка', 'сопло', 'сопля', 'сопун', 'сорго', 'сорит', 'сорок', 'сором', 'сорус', 'сосед', 'сосец', 'соска', 'сосна', 'сосок', 'сосуд', 'сосун', 'сотая', 'сотка', 'сотня', 'софит', 'сохач', 'сошка', 'спазм', 'спесь', 'спина', 'спирт', 'спица', 'сплав', 'сплин', 'спора', 'спорт', 'спрей', 'спрос', 'спрут', 'спурт', 'спуск', 'среда', 'ссора', 'ссуда', 'стадо', 'сталь', 'станс', 'старт', 'старь', 'стать', 'ствол', 'створ', 'стега', 'стезя', 'стека', 'стела', 'стена', 'стенд', 'стень', 'степс', 'степь', 'стило', 'стиль', 'стоик', 'столб', 'столп', 'стопа', 'стояк', 'страж', 'страз', 'страх', 'стриж', 'строй', 'строп', 'струг', 'струп', 'струя', 'стужа', 'ступь', 'стыдь', 'стынь', 'суаре', 'судак', 'судно', 'судок', 'судья', 'суета', 'сукно', 'сулея', 'сулой', 'сумка', 'сумма', 'супер', 'супец', 'супин', 'суржа', 'сурик', 'сурна', 'сурок', 'сусак', 'сусек', 'сусло', 'сутаж', 'сутки', 'суфле', 'сучок', 'сучьё', 'сушка', 'сфера', 'схема', 'схима', 'сцена', 'съезд', 'сынок', 'сыпец', 'сырец', 'сырок', 'сырть', 'сырца', 'сырьё', 'сычуг', 'сыщик', 'сюжет', 'сюита', 'сябёр', 'сяжок', 'табак', 'табло', 'табор', 'табун', 'тавот', 'тавро', 'таган', 'тазик', 'тайга', 'тайна', 'такса', 'такси', 'такыр', 'талер', 'талес', 'талик', 'талия', 'талон', 'талыш', 'тальк', 'тамга', 'танго', 'танец', 'танин', 'танок', 'тапёр', 'тапир', 'тапка', 'таран', 'тариф', 'тарын', 'таска', 'татка', 'тафта', 'тафья', 'тахта', 'тацет', 'тачка', 'ташка', 'тварь', 'твист', 'театр', 'тезис', 'тёзка', 'теизм', 'теист', 'текст', 'телец', 'телик', 'тёлка', 'телок', 'тембр', 'темка', 'тенёк', 'тенор', 'тепло', 'терем', 'тёрка', 'термы', 'терно', 'тесак', 'тёска', 'тесло', 'тесто', 'тесть', 'тётка', 'теург', 'течка', 'тёшка', 'тиара', 'тигра', 'тимол', 'типаж', 'типец', 'типик', 'типун', 'тираж', 'тиран', 'тиски', 'титан', 'титло', 'титул', 'тифон', 'тифус', 'ткань', 'тлень', 'товар', 'тодес', 'тойон', 'токай', 'толай', 'толпа', 'толща', 'томан', 'томат', 'томик', 'тондо', 'тоник', 'тонна', 'тонус', 'топаз', 'топик', 'топка', 'топор', 'топот', 'торба', 'торец', 'торий', 'торит', 'торос', 'тоска', 'тотем', 'тохар', 'точка', 'трава', 'тракт', 'транс', 'транш', 'трапп', 'трасс', 'трата', 'траур', 'треба', 'трель', 'треск', 'трест', 'треть', 'треух', 'трефа', 'триас', 'триба', 'триер', 'трико', 'триод', 'тромб', 'тромп', 'тропа', 'труба', 'труха', 'трюмо', 'туаль', 'тубус', 'тугай', 'тугун', 'тузик', 'тукан', 'тулес', 'тулий', 'тулуз', 'тулук', 'тулун', 'тулуп', 'тулья', 'тумак', 'туман', 'тумба', 'тунец', 'тупей', 'тупец', 'тупик', 'турач', 'турка', 'турне', 'турок', 'тутор', 'тутти', 'туфля', 'тучка', 'тушка', 'тщета', 'тыква', 'тынок', 'тырло', 'тырса', 'тычок', 'тюбик', 'тюник', 'тюрбе', 'тюрбо', 'тюрик', 'тютюн', 'тюфяк', 'тючок', 'тябло', 'тягач', 'тягло', 'тяжба', 'тяпка', 'уазик', 'уброд', 'убрус', 'убыль', 'увраж', 'угода', 'уголь', 'угорь', 'угрев', 'удаль', 'удача', 'удерж', 'удило', 'удэге', 'удэхе', 'узбек', 'узина', 'узник', 'уйгур', 'уклад', 'уклея', 'уклон', 'укроп', 'укрюк', 'уксус', 'улика', 'улита', 'улица', 'улыба', 'умбра', 'умище', 'умник', 'умора', 'униат', 'уника', 'унион', 'унтер', 'унция', 'упрёк', 'упырь', 'ураза', 'урема', 'урина', 'урман', 'усина', 'усище', 'ускок', 'успех', 'устав', 'устой', 'уступ', 'устье', 'утеря', 'утеха', 'утиль', 'утица', 'ухарь', 'ухват', 'ухожь', 'учёба', 'ушица', 'ушкан', 'ушкуй', 'ушник', 'ущерб', 'фабра', 'фавор', 'фавус', 'фагот', 'фадом', 'фазан', 'фазис', 'факел', 'факир', 'фалда', 'фальц', 'фанат', 'фарад', 'фарси', 'фасад', 'фасет', 'фаска', 'фасон', 'фатум', 'фатюй', 'фауна', 'фация', 'фаянс', 'фелон', 'фенол', 'ферзь', 'ферма', 'феска', 'фетиш', 'фетюк', 'фиакр', 'фибра', 'фижмы', 'физик', 'физия', 'фикус', 'филей', 'филёр', 'филин', 'фильм', 'фильц', 'фимоз', 'финал', 'финик', 'финиш', 'финка', 'финна', 'фиорд', 'фирма', 'фитин', 'фишка', 'фланг', 'фланк', 'флейт', 'флейц', 'флешь', 'флинт', 'флирт', 'флокс', 'флора', 'флюид', 'фляга', 'фобия', 'фокус', 'фолио', 'фомка', 'форма', 'форте', 'форум', 'фоска', 'фотон', 'фофан', 'фраер', 'фраза', 'франк', 'франт', 'фрахт', 'фреза', 'френч', 'фронт', 'фрукт', 'фугас', 'фужер', 'фузея', 'фукус', 'фуляр', 'фураж', 'фурия', 'фурма', 'фурор', 'футер', 'футор', 'фуфло', 'фуэте', 'фьорд', 'фюрер', 'хабар', 'хаджи', 'хадис', 'хазар', 'хайло', 'хакас', 'хакер', 'халат', 'халва', 'халда', 'халиф', 'хамит', 'хамка', 'хамса', 'хамьё', 'ханжа', 'ханша', 'хапун', 'харчо', 'хасид', 'хатка', 'хашиш', 'хвала', 'хворь', 'хвост', 'хедер', 'хедив', 'херес', 'херик', 'хиазм', 'хиляк', 'химик', 'химия', 'хинди', 'хинду', 'хинин', 'хиппи', 'хитин', 'хитон', 'хлёст', 'хлупь', 'хлыст', 'хлюст', 'хлябь', 'хмара', 'хмарь', 'хмель', 'хмурь', 'хобби', 'хобот', 'ходок', 'ходун', 'холка', 'холод', 'холоп', 'холст', 'холуй', 'хомут', 'хомяк', 'хорал', 'хорда', 'хорей', 'хорёк', 'хорея', 'хохма', 'хохол', 'хохот', 'хруст', 'хряпа', 'хряск', 'хряст', 'хунта', 'хурал', 'хурма', 'хутор', 'цадик', 'цанга', 'цапка', 'цапля', 'цапун', 'цапфа', 'царёк', 'цацка', 'цевка', 'цевьё', 'цедра', 'цезий', 'целик', 'целое', 'центр', 'цехин', 'цикля', 'цинга', 'циник', 'циста', 'цитра', 'цифра', 'цокот', 'цукат', 'цуцик', 'цыбик', 'цыган', 'цыпка', 'чабан', 'чабер', 'чабёр', 'чадра', 'чайка', 'чакан', 'чалка', 'чалма', 'чарка', 'часик', 'часок', 'часть', 'чашка', 'чебак', 'чёбот', 'чекан', 'чёлка', 'чемер', 'чепан', 'чепец', 'черва', 'червь', 'черёд', 'через', 'черен', 'череп', 'чернь', 'черта', 'чёска', 'честь', 'чётка', 'чехол', 'чечен', 'чечет', 'чешка', 'чешуя', 'чибис', 'чижик', 'чилим', 'чинар', 'чинка', 'чирей', 'чирик', 'чирок', 'чирус', 'чиряк', 'число', 'читка', 'чомга', 'чрево', 'чреда', 'чтиво', 'чтица', 'чубик', 'чубук', 'чувал', 'чуваш', 'чувяк', 'чугун', 'чудак', 'чудик', 'чужак', 'чужая', 'чужое', 'чуйка', 'чукча', 'чулан', 'чулок', 'чумак', 'чурек', 'чурка', 'чутьё', 'чухна', 'чушка', 'шабат', 'шабер', 'шабёр', 'шабли', 'шабот', 'шабур', 'шавка', 'шажок', 'шайба', 'шайка', 'шакал', 'шалаш', 'шалон', 'шалун', 'шаман', 'шамот', 'шанец', 'шанкр', 'шапка', 'шарик', 'шасла', 'шассе', 'шасси', 'шатен', 'шатёр', 'шатия', 'шатун', 'шафер', 'шахта', 'шашка', 'шваль', 'шванк', 'шверт', 'шевро', 'шейка', 'шелеп', 'шелом', 'шельф', 'шемая', 'шёпот', 'шериф', 'шибер', 'шизик', 'шиизм', 'шимми', 'шинок', 'шипок', 'шипун', 'ширма', 'шитво', 'шитик', 'шитьё', 'шифер', 'шифон', 'шихта', 'шишак', 'шишка', 'шкала', 'шквал', 'шкерт', 'шкода', 'школа', 'шкура', 'шланг', 'шлейф', 'шлица', 'шлюха', 'шляпа', 'шмель', 'шмоль', 'шнапс', 'шнека', 'шнява', 'шняка', 'шорня', 'шорох', 'шоссе', 'шофёр', 'шпага', 'шпала', 'шпана', 'шпиль', 'шпион', 'шпора', 'шприц', 'шпрот', 'шпуля', 'шпунт', 'шпынь', 'шримс', 'шрифт', 'штамб', 'штамм', 'штамп', 'штаны', 'штейн', 'штиль', 'штифт', 'штора', 'шторм', 'штосс', 'штраб', 'штраф', 'штрек', 'штрих', 'штука', 'штурм', 'штыка', 'штырь', 'шубка', 'шугай', 'шуйца', 'шулер', 'шумок', 'шурин', 'шурпа', 'шуруп', 'шуряк', 'шутка', 'шушун', 'шхуна', 'щебет', 'щегол', 'щёкот', 'щёлка', 'щёлок', 'щенок', 'щепка', 'щепьё', 'щерба', 'щётка', 'щёчка', 'щипец', 'щипка', 'щипок', 'щитик', 'щиток', 'щупик', 'щурка', 'щучка', 'эвенк', 'эгида', 'эгрет', 'эдикт', 'экзот', 'эклер', 'экран', 'элита', 'эллин', 'эмаль', 'эммер', 'энзим', 'эолит', 'эпика', 'эпонж', 'эпоха', 'эрзац', 'эркер', 'эскиз', 'эспри', 'эстет', 'этика', 'этнос', 'эфиоп', 'эшарп', 'югрич', 'югурт', 'юдоль', 'юзист', 'юкола', 'юниор', 'юница', 'юнкер', 'юнкор', 'юннат', 'юноша', 'юрага', 'юрист', 'юферс', 'ябеда', 'ягель', 'ягода', 'ягуар', 'яичко', 'яишня', 'якорь', 'ямина', 'ямища', 'ямщик', 'ярица', 'ярлык', 'яруга', 'ярыга', 'ясень', 'яспис', 'яство', 'ястык', 'ясырь', 'ятовь', 'яхонт', ]


const numbersOfIterations = 5
const numberOfChars = 5
const ANY_CHAR = "[а-яё]"

class Status {

    black = '#989898'
    yellow = '#C6B566'
    green = '#79A86B'
    white = '#FFFFFF'

    codeByColor(color) {
        switch (color) {
            case this.black:
                return "B"
            case this.yellow:
                return "Y"
            case this.green:
                return "G"
            case this.white:
                return "W"
            default:
                return null
        }
    }

    colorByCode(code) {
        const by_codes = {
            "B": this.black,
            "Y": this.yellow,
            "G": this.green,
            "W": this.white,
        }
        return by_codes[code]
    }
}

const coloredStatus = new Status()

class Cell {
    constructor(char, status) {
        this.char = char
        this.status = status

    }
}

class Position {
    greenChar = null
    yellowChars = []
    blackChars = []

    pattern() {
        if (this.greenChar) {
            return this.greenChar
        }

        return `[^${this.yellowChars.sort().join('')}${this.blackChars.sort().join('')}]` // TODO join arrays
    }

    setGreenChar(char) {
        console.log(`set GREEN char "${char}"`)
        if (this.yellowChars.includes(char)) {
            throw `The '${char}' char cannot be marked GREEN because it was already marked YELLOW`
        }
        else {
            this.greenChar = char
        }
    }

    addYellowChar(char) {
        console.log(`Add YELLOW char "${char}"`)
        if (!this.yellowChars.includes(char)) {
            this.yellowChars.push(char)
        }
    }

    addBlackChar(char) {
        console.log(`Add BLACK char "${char}"`)
        if (!this.blackChars.includes(char)) {
            this.blackChars.push(char)
        }
    }
}

class Iteration {
    constructor(cell1, cell2, cell3, cell4, cell5) {
        this.cell1 = cell1
        this.cell2 = cell2
        this.cell3 = cell3
        this.cell4 = cell4
        this.cell5 = cell5
    }

    cells() {
        return [this.cell1, this.cell2, this.cell3, this.cell4, this.cell5, ]
    }
}

class Game {
    position1 = new Position()
    position2 = new Position()
    position3 = new Position()
    position4 = new Position()
    position5 = new Position()

    positions() {
        return [this.position1, this.position2, this.position3, this.position4, this.position5, ]
    }

    commonBlackChars() {
        // Returns chars that are not present in the entire word (all position's black - all position's green)
        const chars = []
        const positions = this.positions()
        for (let i = 0; i < positions.length; i++) {
            positions[i].blackChars.length > 0 && chars.push(... positions[i].blackChars)
        }
        return [...new Set(chars.filter(f => !this.greenChars().includes(f)))].sort()
    }

    greenChars() {
        const chars = []
        const positions = this.positions()
        for (let i = 0; i < positions.length; i++) {
            positions[i].greenChar && chars.push(positions[i].greenChar)
        }
        return [...new Set(chars)].sort()
    }

    presentChars() {
        const chars = []
        const positions = this.positions()
        for (let i = 0; i < positions.length; i++) {
            positions[i].yellowChars.length > 0 && chars.push(... positions[i].yellowChars)
            positions[i].greenChar && chars.push(positions[i].greenChar)
        }
        return [...new Set(chars)].sort()
    }

    pattern() {
        let pattern = '^'
        const positions = this.positions()
        for (let i = 0; i < positions.length; i++) {
            pattern += positions[i].pattern()
        }
        pattern += "$"
        console.log(`Games's pattern = ${pattern}`)

        return pattern
    }

    addIteration(iteration) {
        const cells = iteration.cells()
        const positions = this.positions()
        for (let i = 0; i < positions.length; i++) {
            if (cells[i].status === coloredStatus.black) {
                positions[i].addBlackChar(cells[i].char)
            }
            else if (cells[i].status === coloredStatus.yellow) {
                positions[i].addYellowChar(cells[i].char)
            }
            else if (cells[i].status === coloredStatus.green) {
                positions[i].setGreenChar(cells[i].char)
            }
        }
    }

    importUserData(data) {
        for (const [word, status] of Object.entries(data)) {
            let cells = []
            for (let i = 0; i < word.length; i++) {
                cells.push(new Cell(word[i], coloredStatus.colorByCode(status[i])))
            }
            this.addIteration(new Iteration(... cells))
        }
    }

    wordIsSuitable(word, pattern) {
        const presentCharsCheck = this.presentChars().every(i => word.includes(i))
        const absentCharsCheck = this.commonBlackChars().every(i => !word.includes(i))
        const patternCheck = Boolean(word.match(pattern))
        return presentCharsCheck && absentCharsCheck && patternCheck
    }

    getSuggestions(source) {
        const currentPattern = this.pattern()
        return source.filter(item => this.wordIsSuitable(item, currentPattern))
    }
}


function generateEmptyTable() {

    const board = document.querySelector('#board')

    for (r = 1; r < numbersOfIterations + 1; r++) {
        const iteration = document.createElement('div')
        iteration.classList.add('iteration')

        for (c = 1; c < numberOfChars + 1; c++) {
            var char = document.createElement('div')
            char.classList.add('char')
            char.innerHTML = "&nbsp"

            if (r === 1 && c === 1) {
                char.classList.add('current')
                iteration.classList.add('current')
            }

            char.setAttribute("status", coloredStatus.white)
            char.addEventListener('click', charClicked)

            iteration.append(char)
        }
        board.append(iteration)
    }
}

function generateKeyboard() {

    const keyboardRow1 = ['Й', 'Ц', 'У', 'К', 'Е', 'Н', 'Г', 'Ш', 'Щ', 'З', 'Х', 'Ъ']
    const keyboardRow2 = ['Ф', 'Ы', 'В', 'А', 'П', 'Р', 'О', 'Л', 'Д', 'Ж', 'Э']
    const keyboardRow3 = ['⌫', 'Я', 'Ч', 'С', 'М', 'И', 'Т', 'Ь', 'Б', 'Ю', '⏎', ]
    const keyboard = [keyboardRow1, keyboardRow2, keyboardRow3]
    const kb = document.querySelector('#kb')

    for (let rowIndex in keyboard) {

        const row = document.createElement("div")
        row.classList.add('row')
        const rowData = keyboard[rowIndex]

        for (let keyIndex in rowData) {
            const key = document.createElement("button")
            key.setAttribute("id", rowData[keyIndex])
            addKeyEventListeners(key, rowData[keyIndex])
            addKeyClasses(key, rowData[keyIndex])
            key.innerHTML = rowData[keyIndex]
            row.append(key)
        }

        kb.append(row)
    }
}

function addKeyClasses(key, value) {

    key.classList.add('key')

    if (value === '⏎') {
        key.classList.add('enter')
    }
    else if (value === '⌫') {
        key.classList.add('backspace')
    }
}


function addKeyEventListeners(key, value) {
    if (value === '⏎') {
        key.addEventListener('click', enterPressed)
    }
    else if (value === '⌫') {
        key.addEventListener('click', backspacePressed)
    }
    else {
        key.addEventListener('click', keyPressed)
    }
}

function keyPressed(event) {
    const value = event.target.firstChild.nodeValue
    fillCurrentChar(value)
    prepareNextChar()
}

function fillCurrentChar(value) {
    const char = document.querySelector(".current.char")
    if (!char) { return }
    char.innerHTML = value
}

function enterPressed(event) {
    console.log('enterPressed')
    clearSuggestions()
    const collectedCharsData = collectData()
    if (Object.keys(collectedCharsData).length === 0) { return }
    showSuggestions(collectedCharsData)
}

function backspacePressed(event) {
    console.log('backspacePressed')
    clearSuggestions()

    const filledChars = document.querySelectorAll(".char.filled")
    if (filledChars.length === 0) {
        return
    }
    const currentChar = document.querySelector(".char.current")
    if (currentChar) { currentChar.classList.remove('current') }

    const lastFilledChar = filledChars[filledChars.length - 1]
    lastFilledChar.classList.remove('filled')
    lastFilledChar.classList.add('current')
    lastFilledChar.innerHTML = '&nbsp'

    setColor(lastFilledChar, coloredStatus.white)
}


function charClicked(event) {
    const char = event.target
    changeCharStatus(char)
}

function setColor(char, color) {
    char.setAttribute('status', color)
    char.style.backgroundColor = color
    char.style.borderColor = color

    if (color === coloredStatus.white) {
        char.style.borderColor = coloredStatus.black
    }
}

function changeCharStatus(char) {

    if (!char.classList.contains('filled')) {
        return
    }

    const status = char.getAttribute("status")
    switch (status) {
        case coloredStatus.black:
            setColor(char, coloredStatus.yellow)
            break
        case coloredStatus.yellow:
            setColor(char, coloredStatus.green)
            break
        default:
            setColor(char, coloredStatus.black)
    }
}

function prepareNextChar() {
    const allChars = document.querySelectorAll(".char")
    for (let i = 0; i < numberOfChars * numbersOfIterations; i++) {
        const currentChar = allChars[i]

        if (currentChar.classList.contains('current'))
            {
                markCharAsFilled(currentChar)
                setColor(currentChar, coloredStatus.black)

                if (i < numberOfChars * numbersOfIterations - 1) {
                    const nextChar = allChars[i + 1]
                    markCharAsCurrent(nextChar)
                    break
                }
            }
    }
}

function markCharAsCurrent(char) {
    char.classList.add("current")
}

function markCharAsFilled(char) {
    char.classList.remove('current')
    char.classList.add('filled')
}

function collectData() {
    let allCharsData = {}
    let lowerWord = ''
    let statuses = ''

    const chars = document.querySelectorAll('.char.filled')
    if (chars.length % 5 != 0 || chars.length === 0) {
        return {}
    }

    for (let i = 0; i < chars.length; i++) {
        const currentChar = chars[i]
        lowerWord += currentChar.innerHTML.toLowerCase()
        statuses += coloredStatus.codeByColor(currentChar.attributes.status.value)
        if (lowerWord.length === 5) {
            allCharsData[lowerWord] = statuses
            lowerWord = ''
            statuses = ''
        }
    }
    return allCharsData
}

function showSuggestions(data) {
    clearSuggestions()

    const game = new Game()
    game.importUserData(data)
    words = game.getSuggestions(defaultData)

    const sg = document.querySelector('#sg')
    for (i = 0; i < words.length; i++) {
        const sug = document.createElement("div")
        sug.setAttribute("id", words[i])
        sug.classList.add('suggestion')
        sug.addEventListener('click', applySuggestion)
        sug.innerHTML = words[i]
        sg.append(sug)
    }
}

function clearSuggestions() {
    const sg = document.querySelector('#sg')
    sg.innerHTML = null
}

function applySuggestion(event) {
    const word = event.target.innerText
    console.log("suggestionPressed")
    for (i = 0; i < numberOfChars; i++) {
        fillCurrentChar(word[i].toUpperCase())
        prepareNextChar()
    }
}

generateEmptyTable()
generateKeyboard()